Repository: dreadwarrior/ext-giftcertificates
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

source: required
de: Pflichtfeld

# tx_giftcertificates_domain_model_certificate
source: a gift certificate
de: ein Geschenkgutschein

# tx_giftcertificates_domain_model_certificate.type
source: type
de: Art

# tx_giftcertificates_domain_model_certificate.type.0
source: value
de: Wertgutschein

# tx_giftcertificates_domain_model_certificate.type.1
source: property
de: Sachgutschein

# tx_giftcertificates_domain_model_certificate.title
source: title
de: Titel

# tx_giftcertificates_domain_model_certificate.description
source: description
de: Beschreibung

# tx_giftcertificates_domain_model_certificate.preview_image
source: preview image
de: Vorschaubild

# tx_giftcertificates_domain_model_certificate.personalization_image
source: personalization image
de: Personalisierungsbild

# tx_giftcertificates_domain_model_certificate.layout
source: TypoScript configuration which defines the certificate layout; can be a reference to a TypoScript object path or direct setup
de: TypoScript Konfiguration die das Gutscheinlayout festlegt; kann eine Referenz auf einen TypoScript Objektpfad sein oder das Setup direkt enthalten

# tx_giftcertificates_domain_model_certificate.articles
source: articles for the property coupon certificate type; this relation is used if the articles are assigned directly to the certificate, without usage of categories
de: Artikel für Sachgutscheine; diese Verknüpfung wird verwendet, wenn Artikel ohne Verwendung von Kategorien einem Gutschein zugewiesen werden sollen

# tx_giftcertificates_domain_model_certificate.categories
source: categories for the property coupon certificate type
de: Kategorien für Sachgutscheine

# tx_giftcertificates_domain_model_article
source: article record for a property coupon certificate type
de: Artikel für Sachgutscheine

# tx_giftcertificates_domain_model_article.title
source: title
de: Titel

# tx_giftcertificates_domain_model_article.description
source: description
de: Beschreibung

# tx_giftcertificates_domain_model_article.image
source: image
de: Bild(er)

# tx_giftcertificates_domain_model_article.value
source: value
de: Wert

# tx_giftcertificates_domain_model_ordering
source: an order groups ordered certificates
de: eine Bestellung fasst bestellte Gutscheine zusammen

# tx_giftcertificates_domain_model_ordering.shipping_type
source: shipping type
de: Versandart

# tx_giftcertificates_domain_model_ordering.payment_type
source: payment type
de: Zahlungsmethode

# tx_giftcertificates_domain_model_ordering.payment_status
source: either payed or not...
de: ist die Bestellung bezahlt?

# tx_giftcertificates_domain_model_ordering.payment_transaction_id
source: transaction id of external payment provider or empty if payment on account
de: Transaktions-ID eines externen Zahlungsanbieters; leer bei Kauf auf Rechnung

# tx_giftcertificates_domain_model_ordering.ordering_items
source: ordering items
de: Bestellposition

# tx_giftcertificates_domain_model_orderingitem
source: Ordering item
de: Bestellposition

# tx_giftcertificates_domain_model_orderingitem.identification
source: identification for the certificate; root level OrderItem only
de: Identifikation des Gutscheins; nur für Bestellpositionen auf der ersten Ebene

# tx_giftcertificates_domain_model_orderingitem.amount
source: reflects amount of selected articles (NOT certificates!)
de: Anzahl ausgewählter Artikel (KEINE Gutscheine!)

# tx_giftcertificates_domain_model_orderingitem.value
source: reflects price of an certificate or article
de: Preis eines Gutscheins oder Artikels

# tx_giftcertificates_domain_model_orderingitem.certificate
source: certificate
de: Gutschein

# tx_giftcertificates_domain_model_orderingitem.article
source: article
de: Artikel

# tx_giftcertificates_domain_model_category
source: a category groups articles for property coupon certificates
de: eine Kategorie fasst Artikel für Sachgutscheine zusammen

# tx_giftcertificates_domain_model_category.title
source: title
de: Titel

# tx_giftcertificates_domain_model_category.description
source: description
de: Beschreibung

# tx_giftcertificates_domain_model_category.parent_category
source: allows nested hierarchies of article categories
de: übergeordnete Kategorie

# tx_giftcertificates_domain_model_category.articles
source: articles in a certain category
de: Artikel in der Kategorie

# tx_giftcertificates_workflow.order_details
source: order details
de: zur Bestellung
